cask_args appdir: "/Applications"

tap "homebrew/cask-versions"

brew "aws-shell"
brew "awscli"
brew "cmake"
brew "direnv"
brew "dockutil"
brew "emacs"
brew "gawk"
brew "gettext", link: true
brew "git"
brew "htop"
brew "jq"
brew "lastpass-cli"
brew "node@10"
brew "npm"
brew "pwgen"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "ruby-install"
brew "terraform@0.11"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "vault"
brew "vim"
brew "watch"
brew "wget"
brew "yarn", args: ["ignore-dependencies"]

tap "git-duet/tap"
brew "git-duet"
# Commenting out jdk 1.8 as I neeed a specific patch version installed
#cask "adoptopenjdk8"
cask "adoptopenjdk11"
brew "gradle"
brew "gradle-completion"
brew "groovysdk"
brew "liquibase"
brew "maven"
brew "openapi-generator"

# As of writing this installs 19.3.0 which is working with vertx/quarkus yet
#cask "graalvm/tap/graalvm-ce-java11"
#cask "graalvm/tap/graalvm-ce-java8"

cask "1password"
cask "aquamacs"
cask "atom"
cask "authy"
cask "chromedriver"
cask "docker"
cask "firefox"
cask "flycut"
cask "google-cloud-sdk"
cask "insomnia"
cask "istat-menus"
cask "iterm2"
cask "postman"
cask "postgres"
cask "slack"
cask "sublime-text"
cask "time-out"
cask "tunnelblick"
cask "xscreensaver"
cask "zoomus"

tap "universal-ctags/universal-ctags"
brew "universal-ctags", args: ["HEAD"]
#flyway needs to be after java
brew "flyway"

tap "homebrew/cask-fonts"
cask "font-fira-code"

#these may or may not be installed depending on image
cask "shiftit" unless system "[ -d /Applications/ShiftIt.app/ ]"
cask "google-chrome" unless system "[ -d '/Applications/Google\ Chrome.app/' ]"
cask "jetbrains-toolbox" unless system "[ -d '/Applications/JetBrains\ Toolbox.app/' ]"

tap "aws/tap"
brew "aws-sam-cli"
