cask_args appdir: "/Applications"

tap "homebrew/cask-versions"
tap "heroku/brew"

brew "aws-shell"
brew "awscli"
brew "cmake"
brew "direnv"
brew "dockutil"
brew "gawk"
brew "gettext", link: true
brew "git"
brew "gh"
brew "go"
brew "grok"
brew "heroku"
brew "htop"
brew "libtool"
brew "lnav"
brew "jq"
brew "lastpass-cli"
brew "node@10"
brew "npm"
brew "nmap"
brew "pandoc"
brew "psqlodbc"
brew "pwgen"
brew "python"
brew "python3"
brew "r"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "ruby-install"
brew "terraform@0.11"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "unixodbc"
brew "vault"
brew "vim"
brew "watch"
brew "wget"
brew "yarn", args: ["ignore-dependencies"]

brew "koekeishiya/formulae/yabai" # tiling window manager, pre-req: https://github.com/koekeishiya/yabai/wiki/Disabling-System-Integrity-Protection
brew "koekeishiya/formulae/skhd" #hotkey deamon for use with yabai

tap "git-duet/tap"
brew "git-duet"
# Commenting out jdk 1.8 as I need a specific patch version installed
#cask "adoptopenjdk8"
cask "adoptopenjdk11"
brew "gradle"
brew "gradle-completion"
brew "groovysdk"
brew "liquibase"
brew "maven"
brew "openapi-generator"

# As of writing this installs 19.3.0 which is working with vertx/quarkus yet
#cask "graalvm/tap/graalvm-ce-java11"
#cask "graalvm/tap/graalvm-ce-java8"

cask "1password"
cask "android-platform-tools"
cask "android-sdk"
cask "atom"
cask "authy"
cask "basictex"
cask "ccmenu"
cask "choosy"
cask "chromedriver"
cask "docker"
cask "firefox"
cask "flycut"
cask "google-cloud-sdk"
#cask "google-earth-pro"
cask "insomnia"
cask "istat-menus"
cask "iterm2"
#cask "plex"
cask "postman"
cask "postgres"
cask "rstudio"
cask "signal"
cask "slack"
cask "spotify"
cask "sublime-text"
#cask "time-out"
cask "tunnelblick"
cask "turbovnc-viewer"
cask "visual-studio-code"
cask "wireshark"
cask "xquartz"
cask "xscreensaver"
cask "zoomus"

tap "universal-ctags/universal-ctags"
brew "universal-ctags", args: ["HEAD"]
#flyway needs to be after java
brew "flyway"

tap "homebrew/cask-fonts"
cask "font-fira-code"

#these may or may not be installed depending on image
cask "shiftit" unless system "[ -d /Applications/ShiftIt.app/ ]"
cask "google-chrome" unless system "[ -d '/Applications/Google\ Chrome.app/' ]"
cask "jetbrains-toolbox" unless system "[ -d '/Applications/JetBrains\ Toolbox.app/' ]"

tap "aws/tap"
brew "aws-sam-cli"
